package handlers

/*
АНАЛИТИКА

Шаг 1 - Аналитика по пользователям

- Описать как пройти авторизацию для доступа к API

- API списка пользователей:

Модель для получения
- user ID (ид пользователя)
- asset ID (ид токена/асета)
- wallet (кошелек для данного асета)
- timestamp (время создания/импорта кошелька)

Фильтр: from-to по timestamp

Сортировка: timestamp от старого к новому

Шаг 2 - Оборот стредств внутри кошелька

- Реализовать запоминание txID внутренних транзакций кошелька

После создания каждой транзакции через наш кошелек отправлять TX ID на сервер и запоминать его в отдельную таблицу. После можно будет метчить эту таблицу с таблицами транзакций для того чтобы отличать внутренние и внешние транзы

- API транзакций

На данный момент интересны только исходящие транзакции.

Желательно объединить в один запрос транзакции BTC и ETH подобных + TRX. Если так не получится то предоставить идентичные по модели API для групп сетей.

Модель для получения
- user ID
- asset ID
- amount
- tx ID
- internal (true | false в зависимости от наличия транзы в списке наших внутренних)
- timestamp

Фильтр: from-to по timestamp

Сортировка: timestamp от старого к новому
*/
